{"keras_version": "2.0.9", "class_name": "Model", "backend": "tensorflow", "config": {"output_layers": [["dense_6", 0, 0]], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0]], "name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "input_2", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000], "name": "input_2", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "input_3", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1000], "name": "input_3", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "dense_1", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "units": 1000, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "name": "dense_1", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dense_2", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "units": 1000, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "name": "dense_2", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "units": 1000, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "name": "dense_3", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["input_3", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_1", "beta_regularizer": null, "scale": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null}, "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_2", "beta_regularizer": null, "scale": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_3", "beta_regularizer": null, "scale": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "activation_1", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_1", "trainable": true}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "activation_2", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_2", "trainable": true}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "activation_3", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_3", "trainable": true}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "dropout_1", "class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "name": "dropout_1", "trainable": true, "rate": 0.3}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"name": "dropout_2", "class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "name": "dropout_2", "trainable": true, "rate": 0.3}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"name": "dropout_3", "class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "name": "dropout_3", "trainable": true, "rate": 0.3}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"name": "concatenate_1", "class_name": "Concatenate", "config": {"axis": -1, "name": "concatenate_1", "trainable": true}, "inbound_nodes": [[["dropout_1", 0, 0, {}], ["dropout_2", 0, 0, {}], ["dropout_3", 0, 0, {}]]]}, {"name": "dense_4", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "units": 1024, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "name": "dense_4", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"center": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_4", "beta_regularizer": null, "scale": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_constraint": null, "axis": -1, "epsilon": 0.001, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "momentum": 0.99, "beta_constraint": null}, "inbound_nodes": [[["dense_4", 0, 0, {}]]]}, {"name": "activation_4", "class_name": "Activation", "config": {"activation": "relu", "name": "activation_4", "trainable": true}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "dropout_4", "class_name": "Dropout", "config": {"noise_shape": null, "seed": null, "name": "dropout_4", "trainable": true, "rate": 0.3}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"name": "dense_5", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "units": 512, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "name": "dense_5", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"name": "dense_6", "class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "use_bias": true, "units": 152, "bias_regularizer": null, "activity_regularizer": null, "activation": "linear", "trainable": true, "kernel_regularizer": null, "name": "dense_6", "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null}, "inbound_nodes": [[["dense_5", 0, 0, {}]]]}]}}