{"keras_version": "2.0.9", "backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["dense_346", 0, 0]], "layers": [{"class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, null, null, 3], "sparse": false, "name": "input_15", "dtype": "float32"}, "name": "input_15"}, {"class_name": "Conv2D", "inbound_nodes": [[["input_15", 0, 0, {}]]], "config": {"padding": "valid", "filters": 32, "name": "conv2d_941", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [2, 2], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_941"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_941", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_941", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_941"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_941", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_941"}, "name": "activation_941"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_941", 0, 0, {}]]], "config": {"padding": "valid", "filters": 32, "name": "conv2d_942", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_942"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_942", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_942", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_942"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_942", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_942"}, "name": "activation_942"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_942", 0, 0, {}]]], "config": {"padding": "same", "filters": 64, "name": "conv2d_943", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_943"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_943", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_943", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_943"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_943", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_943"}, "name": "activation_943"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_943", 0, 0, {}]]], "config": {"padding": "valid", "pool_size": [3, 3], "name": "max_pooling2d_41", "trainable": false, "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_41"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_41", 0, 0, {}]]], "config": {"padding": "valid", "filters": 80, "name": "conv2d_944", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_944"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_944", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_944", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_944"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_944", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_944"}, "name": "activation_944"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_944", 0, 0, {}]]], "config": {"padding": "valid", "filters": 192, "name": "conv2d_945", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_945"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_945", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_945", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_945"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_945", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_945"}, "name": "activation_945"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["activation_945", 0, 0, {}]]], "config": {"padding": "valid", "pool_size": [3, 3], "name": "max_pooling2d_42", "trainable": false, "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_42"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_42", 0, 0, {}]]], "config": {"padding": "same", "filters": 64, "name": "conv2d_949", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_949"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_949", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_949", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_949"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_949", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_949"}, "name": "activation_949"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_42", 0, 0, {}]]], "config": {"padding": "same", "filters": 48, "name": "conv2d_947", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_947"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_949", 0, 0, {}]]], "config": {"padding": "same", "filters": 96, "name": "conv2d_950", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_950"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_947", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_947", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_947"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_950", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_950", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_950"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_947", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_947"}, "name": "activation_947"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_950", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_950"}, "name": "activation_950"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["max_pooling2d_42", 0, 0, {}]]], "config": {"padding": "same", "pool_size": [3, 3], "name": "average_pooling2d_91", "trainable": false, "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_91"}, {"class_name": "Conv2D", "inbound_nodes": [[["max_pooling2d_42", 0, 0, {}]]], "config": {"padding": "same", "filters": 64, "name": "conv2d_946", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_946"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_947", 0, 0, {}]]], "config": {"padding": "same", "filters": 64, "name": "conv2d_948", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [5, 5]}, "name": "conv2d_948"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_950", 0, 0, {}]]], "config": {"padding": "same", "filters": 96, "name": "conv2d_951", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_951"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_91", 0, 0, {}]]], "config": {"padding": "same", "filters": 32, "name": "conv2d_952", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_952"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_946", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_946", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_946"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_948", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_948", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_948"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_951", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_951", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_951"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_952", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_952", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_952"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_946", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_946"}, "name": "activation_946"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_948", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_948"}, "name": "activation_948"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_951", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_951"}, "name": "activation_951"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_952", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_952"}, "name": "activation_952"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_946", 0, 0, {}], ["activation_948", 0, 0, {}], ["activation_951", 0, 0, {}], ["activation_952", 0, 0, {}]]], "config": {"trainable": false, "name": "mixed0", "axis": 3}, "name": "mixed0"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"padding": "same", "filters": 64, "name": "conv2d_956", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_956"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_956", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_956", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_956"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_956", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_956"}, "name": "activation_956"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"padding": "same", "filters": 48, "name": "conv2d_954", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_954"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_956", 0, 0, {}]]], "config": {"padding": "same", "filters": 96, "name": "conv2d_957", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_957"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_954", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_954", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_954"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_957", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_957", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_957"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_954", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_954"}, "name": "activation_954"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_957", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_957"}, "name": "activation_957"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"padding": "same", "pool_size": [3, 3], "name": "average_pooling2d_92", "trainable": false, "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_92"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed0", 0, 0, {}]]], "config": {"padding": "same", "filters": 64, "name": "conv2d_953", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_953"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_954", 0, 0, {}]]], "config": {"padding": "same", "filters": 64, "name": "conv2d_955", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [5, 5]}, "name": "conv2d_955"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_957", 0, 0, {}]]], "config": {"padding": "same", "filters": 96, "name": "conv2d_958", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_958"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_92", 0, 0, {}]]], "config": {"padding": "same", "filters": 64, "name": "conv2d_959", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_959"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_953", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_953", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_953"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_955", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_955", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_955"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_958", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_958", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_958"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_959", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_959", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_959"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_953", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_953"}, "name": "activation_953"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_955", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_955"}, "name": "activation_955"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_958", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_958"}, "name": "activation_958"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_959", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_959"}, "name": "activation_959"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_953", 0, 0, {}], ["activation_955", 0, 0, {}], ["activation_958", 0, 0, {}], ["activation_959", 0, 0, {}]]], "config": {"trainable": false, "name": "mixed1", "axis": 3}, "name": "mixed1"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"padding": "same", "filters": 64, "name": "conv2d_963", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_963"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_963", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_963", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_963"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_963", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_963"}, "name": "activation_963"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"padding": "same", "filters": 48, "name": "conv2d_961", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_961"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_963", 0, 0, {}]]], "config": {"padding": "same", "filters": 96, "name": "conv2d_964", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_964"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_961", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_961", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_961"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_964", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_964", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_964"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_961", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_961"}, "name": "activation_961"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_964", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_964"}, "name": "activation_964"}, {"class_name": "AveragePooling2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"padding": "same", "pool_size": [3, 3], "name": "average_pooling2d_93", "trainable": false, "strides": [1, 1], "data_format": "channels_last"}, "name": "average_pooling2d_93"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed1", 0, 0, {}]]], "config": {"padding": "same", "filters": 64, "name": "conv2d_960", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_960"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_961", 0, 0, {}]]], "config": {"padding": "same", "filters": 64, "name": "conv2d_962", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [5, 5]}, "name": "conv2d_962"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_964", 0, 0, {}]]], "config": {"padding": "same", "filters": 96, "name": "conv2d_965", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_965"}, {"class_name": "Conv2D", "inbound_nodes": [[["average_pooling2d_93", 0, 0, {}]]], "config": {"padding": "same", "filters": 64, "name": "conv2d_966", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_966"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_960", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_960", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_960"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_962", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_962", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_962"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_965", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_965", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_965"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_966", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_966", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_966"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_960", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_960"}, "name": "activation_960"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_962", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_962"}, "name": "activation_962"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_965", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_965"}, "name": "activation_965"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_966", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_966"}, "name": "activation_966"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_960", 0, 0, {}], ["activation_962", 0, 0, {}], ["activation_965", 0, 0, {}], ["activation_966", 0, 0, {}]]], "config": {"trainable": false, "name": "mixed2", "axis": 3}, "name": "mixed2"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"padding": "same", "filters": 64, "name": "conv2d_968", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_968"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_968", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_968", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_968"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_968", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_968"}, "name": "activation_968"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_968", 0, 0, {}]]], "config": {"padding": "same", "filters": 96, "name": "conv2d_969", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_969"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_969", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_969", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_969"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_969", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_969"}, "name": "activation_969"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"padding": "valid", "filters": 384, "name": "conv2d_967", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [2, 2], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_967"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_969", 0, 0, {}]]], "config": {"padding": "valid", "filters": 96, "name": "conv2d_970", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [2, 2], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [3, 3]}, "name": "conv2d_970"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_967", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_967", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_967"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_970", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_970", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_970"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_967", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_967"}, "name": "activation_967"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_970", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_970"}, "name": "activation_970"}, {"class_name": "MaxPooling2D", "inbound_nodes": [[["mixed2", 0, 0, {}]]], "config": {"padding": "valid", "pool_size": [3, 3], "name": "max_pooling2d_43", "trainable": false, "strides": [2, 2], "data_format": "channels_last"}, "name": "max_pooling2d_43"}, {"class_name": "Concatenate", "inbound_nodes": [[["activation_967", 0, 0, {}], ["activation_970", 0, 0, {}], ["max_pooling2d_43", 0, 0, {}]]], "config": {"trainable": false, "name": "mixed3", "axis": 3}, "name": "mixed3"}, {"class_name": "Conv2D", "inbound_nodes": [[["mixed3", 0, 0, {}]]], "config": {"padding": "same", "filters": 128, "name": "conv2d_975", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [1, 1]}, "name": "conv2d_975"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_975", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_975", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, "trainable": false, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}}, "name": "batch_normalization_975"}, {"class_name": "Activation", "inbound_nodes": [[["batch_normalization_975", 0, 0, {}]]], "config": {"trainable": false, "activation": "relu", "name": "activation_975"}, "name": "activation_975"}, {"class_name": "Conv2D", "inbound_nodes": [[["activation_975", 0, 0, {}]]], "config": {"padding": "same", "filters": 128, "name": "conv2d_976", "dilation_rate": [1, 1], "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "data_format": "channels_last", "strides": [1, 1], "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "distribution": "uniform", "scale": 1.0}}, "activity_regularizer": null, "kernel_constraint": null, "trainable": false, "activation": "linear", "use_bias": false, "bias_regularizer": null, "kernel_size": [7, 1]}, "name": "conv2d_976"}, {"class_name": "BatchNormalization", "inbound_nodes": [[["conv2d_976", 0, 0, {}]]], "config": {"beta_initializer": {"class_name": "Zeros", "config": {}}, "name": "batch_normalization_976", "epsilon": 0.001, "axis": 3, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": false, "center": true, "beta_regularizer": null, "gamma_regularizer": null, "momentum": 0.99, "gamma_constraint": null, 