{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 299, 299, 3], "name": "input_1", "sparse": false}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_size": [6, 6], "bias_regularizer": null, "bias_constraint": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_1", "use_bias": true, "padding": "same", "activation": "linear"}, "name": "conv2d_1", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "bias_constraint": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_7", "use_bias": true, "padding": "same", "activation": "linear"}, "name": "conv2d_7", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "beta_constraint": null, "scale": true, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_1", "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "beta_constraint": null, "scale": true, "name": "batch_normalization_7", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_7", "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "name": "activation_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_7", "trainable": true, "activation": "relu"}, "name": "activation_7", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_7", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_7", "inbound_nodes": [[["activation_7", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_size": [6, 6], "bias_regularizer": null, "bias_constraint": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_2", "use_bias": true, "padding": "same", "activation": "linear"}, "name": "conv2d_2", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "bias_constraint": null, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_8", "use_bias": true, "padding": "same", "activation": "linear"}, "name": "conv2d_8", "inbound_nodes": [[["dropout_7", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "beta_constraint": null, "scale": true, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "beta_constraint": null, "scale": true, "name": "batch_normalization_8", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_8", "inbound_nodes": [[["conv2d_8", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "name": "activation_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_8", "trainable": true, "activation": "relu"}, "name": "activation_8", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_2", "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_8", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_8", "inbound_nodes": [[["activation_8", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_1", "padding": "valid", "pool_size": [2, 2]}, "name": "max_pooling2d_1", "inbound_nodes": [[["dropout_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_4", "padding": "valid", "pool_size": [2, 2]}, "name": "max_pooling2d_4", "inbound_nodes": [[["dropout_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_size": [6, 6], "bias_regularizer": null, "bias_constraint": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_3", "use_bias": true, "padding": "same", "activation": "linear"}, "name": "conv2d_3", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "bias_constraint": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_9", "use_bias": true, "padding": "same", "activation": "linear"}, "name": "conv2d_9", "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "beta_constraint": null, "scale": true, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "beta_constraint": null, "scale": true, "name": "batch_normalization_9", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_9", "inbound_nodes": [[["conv2d_9", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "name": "activation_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_9", "trainable": true, "activation": "relu"}, "name": "activation_9", "inbound_nodes": [[["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_3", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_3", "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_9", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_9", "inbound_nodes": [[["activation_9", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_size": [6, 6], "bias_regularizer": null, "bias_constraint": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_4", "use_bias": true, "padding": "same", "activation": "linear"}, "name": "conv2d_4", "inbound_nodes": [[["dropout_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "bias_constraint": null, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_10", "use_bias": true, "padding": "same", "activation": "linear"}, "name": "conv2d_10", "inbound_nodes": [[["dropout_9", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "beta_constraint": null, "scale": true, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "beta_constraint": null, "scale": true, "name": "batch_normalization_10", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_10", "inbound_nodes": [[["conv2d_10", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "name": "activation_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_10", "trainable": true, "activation": "relu"}, "name": "activation_10", "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_4", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_4", "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_10", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_10", "inbound_nodes": [[["activation_10", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_2", "padding": "valid", "pool_size": [2, 2]}, "name": "max_pooling2d_2", "inbound_nodes": [[["dropout_4", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_5", "padding": "valid", "pool_size": [2, 2]}, "name": "max_pooling2d_5", "inbound_nodes": [[["dropout_10", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_size": [6, 6], "bias_regularizer": null, "bias_constraint": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_5", "use_bias": true, "padding": "same", "activation": "linear"}, "name": "conv2d_5", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "bias_constraint": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_11", "use_bias": true, "padding": "same", "activation": "linear"}, "name": "conv2d_11", "inbound_nodes": [[["max_pooling2d_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "beta_constraint": null, "scale": true, "name": "batch_normalization_5", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_5", "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "beta_constraint": null, "scale": true, "name": "batch_normalization_11", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_11", "inbound_nodes": [[["conv2d_11", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "name": "activation_5", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_11", "trainable": true, "activation": "relu"}, "name": "activation_11", "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_5", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_5", "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_11", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_11", "inbound_nodes": [[["activation_11", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_size": [6, 6], "bias_regularizer": null, "bias_constraint": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_6", "use_bias": true, "padding": "same", "activation": "linear"}, "name": "conv2d_6", "inbound_nodes": [[["dropout_5", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "bias_constraint": null, "filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_12", "use_bias": true, "padding": "same", "activation": "linear"}, "name": "conv2d_12", "inbound_nodes": [[["dropout_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "beta_constraint": null, "scale": true, "name": "batch_normalization_6", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_6", "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "beta_constraint": null, "scale": true, "name": "batch_normalization_12", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_12", "inbound_nodes": [[["conv2d_12", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "name": "activation_6", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_12", "trainable": true, "activation": "relu"}, "name": "activation_12", "inbound_nodes": [[["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_6", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_6", "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_12", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_12", "inbound_nodes": [[["activation_12", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_3", "padding": "valid", "pool_size": [2, 2]}, "name": "max_pooling2d_3", "inbound_nodes": [[["dropout_6", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "data_format": "channels_last", "strides": [2, 2], "name": "max_pooling2d_6", "padding": "valid", "pool_size": [2, 2]}, "name": "max_pooling2d_6", "inbound_nodes": [[["dropout_12", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "concatenate_1", "trainable": true, "axis": -1}, "name": "concatenate_1", "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}], ["max_pooling2d_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"dilation_rate": [1, 1], "trainable": true, "kernel_size": [3, 3], "bias_regularizer": null, "bias_constraint": null, "filters": 512, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "activity_regularizer": null, "kernel_constraint": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_13", "use_bias": true, "padding": "same", "activation": "linear"}, "name": "conv2d_13", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "trainable": true, "momentum": 0.99, "center": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_regularizer": null, "axis": -1, "gamma_constraint": null, "epsilon": 0.001, "beta_constraint": null, "scale": true, "name": "batch_normalization_13", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}}, "name": "batch_normalization_13", "inbound_nodes": [[["conv2d_13", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_13", "trainable": true, "activation": "relu"}, "name": "activation_13", "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_13", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_13", "inbound_nodes": [[["activation_13", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}, "name": "global_average_pooling2d_1", "inbound_nodes": [[["dropout_13", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 1024, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "use_bias": true, "activation": "relu"}, "name": "dense_1", "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_14", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_14", "inbound_nodes": [[["dense_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 512, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_2", "use_bias": true, "activation": "relu"}, "name": "dense_2", "inbound_nodes": [[["dropout_14", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_15", "trainable": true, "rate": 0.3, "seed": null, "noise_shape": null}, "name": "dropout_15", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"bias_regularizer": null, "trainable": true, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "scale": 1.0, "mode": "fan_avg", "seed": null}}, "units": 152, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_3", "use_bias": true, "activation": "linear"}, "name": "dense_3", "inbound_nodes": [[["dropout_15", 0, 0, {}]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "keras_version": "2.0.9", "backend": "tensorflow"}