{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.9", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 299, 299, 3], "sparse": false, "name": "input_1", "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv1", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"strides": [2, 2], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "conv1", "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [7, 7], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn_conv1", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_conv1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "config": {"name": "activation_1", "trainable": false, "activation": "relu"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "inbound_nodes": [[["activation_1", 0, 0, {}]]], "config": {"pool_size": [3, 3], "name": "max_pooling2d_1", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": false}}, {"class_name": "Conv2D", "name": "res2a_branch2a", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2a_branch2a", "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2a_branch2a", "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "config": {"name": "activation_2", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2a_branch2b", "inbound_nodes": [[["activation_2", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2a_branch2b", "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2a_branch2b", "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "config": {"name": "activation_3", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2a_branch2c", "inbound_nodes": [[["activation_3", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2a_branch2c", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Conv2D", "name": "res2a_branch1", "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2a_branch1", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2a_branch2c", "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2a_branch1", "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_1", "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "config": {"name": "add_1", "trainable": false}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["add_1", 0, 0, {}]]], "config": {"name": "activation_4", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2b_branch2a", "inbound_nodes": [[["activation_4", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2b_branch2a", "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2b_branch2a", "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2b_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "config": {"name": "activation_5", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2b_branch2b", "inbound_nodes": [[["activation_5", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2b_branch2b", "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2b_branch2b", "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2b_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "config": {"name": "activation_6", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2b_branch2c", "inbound_nodes": [[["activation_6", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2b_branch2c", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2b_branch2c", "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2b_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_2", "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_4", 0, 0, {}]]], "config": {"name": "add_2", "trainable": false}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["add_2", 0, 0, {}]]], "config": {"name": "activation_7", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2c_branch2a", "inbound_nodes": [[["activation_7", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2c_branch2a", "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2c_branch2a", "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2c_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "config": {"name": "activation_8", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2c_branch2b", "inbound_nodes": [[["activation_8", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2c_branch2b", "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2c_branch2b", "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2c_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_9", "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "config": {"name": "activation_9", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2c_branch2c", "inbound_nodes": [[["activation_9", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2c_branch2c", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2c_branch2c", "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2c_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_3", "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_7", 0, 0, {}]]], "config": {"name": "add_3", "trainable": false}}, {"class_name": "Activation", "name": "activation_10", "inbound_nodes": [[["add_3", 0, 0, {}]]], "config": {"name": "activation_10", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3a_branch2a", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"strides": [2, 2], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3a_branch2a", "filters": 128, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3a_branch2a", "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_11", "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "config": {"name": "activation_11", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3a_branch2b", "inbound_nodes": [[["activation_11", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3a_branch2b", "filters": 128, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3a_branch2b", "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_12", "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "config": {"name": "activation_12", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3a_branch2c", "inbound_nodes": [[["activation_12", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3a_branch2c", "filters": 512, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Conv2D", "name": "res3a_branch1", "inbound_nodes": [[["activation_10", 0, 0, {}]]], "config": {"strides": [2, 2], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3a_branch1", "filters": 512, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3a_branch2c", "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3a_branch1", "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_4", "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "config": {"name": "add_4", "trainable": false}}, {"class_name": "Activation", "name": "activation_13", "inbound_nodes": [[["add_4", 0, 0, {}]]], "config": {"name": "activation_13", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3b_branch2a", "inbound_nodes": [[["activation_13", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3b_branch2a", "filters": 128, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3b_branch2a", "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3b_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_14", "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "config": {"name": "activation_14", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3b_branch2b", "inbound_nodes": [[["activation_14", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3b_branch2b", "filters": 128, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3b_branch2b", "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3b_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_15", "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "config": {"name": "activation_15", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3b_branch2c", "inbound_nodes": [[["activation_15", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3b_branch2c", "filters": 512, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3b_branch2c", "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3b_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_5", "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_13", 0, 0, {}]]], "config": {"name": "add_5", "trainable": false}}, {"class_name": "Activation", "name": "activation_16", "inbound_nodes": [[["add_5", 0, 0, {}]]], "config": {"name": "activation_16", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3c_branch2a", "inbound_nodes": [[["activation_16", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3c_branch2a", "filters": 128, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3c_branch2a", "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3c_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_17", "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "config": {"name": "activation_17", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3c_branch2b", "inbound_nodes": [[["activation_17", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3c_branch2b", "filters": 128, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3c_branch2b", "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3c_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_18", "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "config": {"name": "activation_18", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3c_branch2c", "inbound_nodes": [[["activation_18", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3c_branch2c", "filters": 512, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3c_branch2c", "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3c_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_6", "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_16", 0, 0, {}]]], "config": {"name": "add_6", "trainable": false}}, {"class_name": "Activation", "name": "activation_19", "inbound_nodes": [[["add_6", 0, 0, {}]]], "config": {"name": "activation_19", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3d_branch2a", "inbound_nodes": [[["activation_19", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3d_branch2a", "filters": 128, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3d_branch2a", "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3d_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_20", "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "config": {"name": "activation_20", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3d_branch2b", "inbound_nodes": [[["activation_20", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3d_branch2b", "filters": 128, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3d_branch2b", "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3d_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_21", "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "config": {"name": "activation_21", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3d_branch2c", "inbound_nodes": [[["activation_21", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3d_branch2c", "filters": 512, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3d_branch2c", "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3d_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_7", "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_19", 0, 0, {}]]], "config": {"name": "add_7", "trainable": false}}, {"class_name": "Activation", "name": "activation_22", "inbound_nodes": [[["add_7", 0, 0, {}]]], "config": {"name": "activation_22", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4a_branch2a", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"strides": [2, 2], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4a_branch2a", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4a_branch2a", "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_23", "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "config": {"name": "activation_23", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4a_branch2b", "inbound_nodes": [[["activation_23", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4a_branch2b", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4a_branch2b", "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_24", "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "config": {"name": "activation_24", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4a_branch2c", "inbound_nodes": [[["activation_24", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4a_branch2c", "filters": 1024, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Conv2D", "name": "res4a_branch1", "inbound_nodes": [[["activation_22", 0, 0, {}]]], "config": {"strides": [2, 2], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4a_branch1", "filters": 1024, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4a_branch2c", "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4a_branch1", "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_8", "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "config": {"name": "add_8", "trainable": false}}, {"class_name": "Activation", "name": "activation_25", "inbound_nodes": [[["add_8", 0, 0, {}]]], "config": {"name": "activation_25", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4b_branch2a", "inbound_nodes": [[["activation_25", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4b_branch2a", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4b_branch2a", "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4b_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_26", "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "config": {"name": "activation_26", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4b_branch2b", "inbound_nodes": [[["activation_26", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4b_branch2b", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4b_branch2b", "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4b_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_27", "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]], "config": {"name": "activation_27", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4b_branch2c", "inbound_nodes": [[["activation_27", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4b_branch2c", "filters": 1024, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4b_branch2c", "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4b_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_9", "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_25", 0, 0, {}]]], "config": {"name": "add_9", "trainable": false}}, {"class_name": "Activation", "name": "activation_28", "inbound_nodes": [[["add_9", 0, 0, {}]]], "config": {"name": "activation_28", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4c_branch2a", "inbound_nodes": [[["activation_28", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4c_branch2a", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4c_branch2a", "inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4c_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_29", "inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]], "config": {"name": "activation_29", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4c_branch2b", "inbound_nodes": [[["activation_29", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4c_branch2b", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4c_branch2b", "inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4c_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_30", "inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]], "config": {"name": "activation_30", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4c_branch2c", "inbound_nodes": [[["activation_30", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": 