{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.0.9", "config": {"layers": [{"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"batch_input_shape": [null, 299, 299, 3], "sparse": false, "name": "input_2", "dtype": "float32"}}, {"class_name": "Conv2D", "name": "conv1", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"strides": [2, 2], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "conv1", "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [7, 7], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn_conv1", "inbound_nodes": [[["conv1", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn_conv1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_50", "inbound_nodes": [[["bn_conv1", 0, 0, {}]]], "config": {"name": "activation_50", "trainable": false, "activation": "relu"}}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "inbound_nodes": [[["activation_50", 0, 0, {}]]], "config": {"pool_size": [3, 3], "name": "max_pooling2d_2", "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "trainable": false}}, {"class_name": "Conv2D", "name": "res2a_branch2a", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2a_branch2a", "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2a_branch2a", "inbound_nodes": [[["res2a_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_51", "inbound_nodes": [[["bn2a_branch2a", 0, 0, {}]]], "config": {"name": "activation_51", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2a_branch2b", "inbound_nodes": [[["activation_51", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2a_branch2b", "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2a_branch2b", "inbound_nodes": [[["res2a_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_52", "inbound_nodes": [[["bn2a_branch2b", 0, 0, {}]]], "config": {"name": "activation_52", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2a_branch2c", "inbound_nodes": [[["activation_52", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2a_branch2c", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Conv2D", "name": "res2a_branch1", "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2a_branch1", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2a_branch2c", "inbound_nodes": [[["res2a_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2a_branch1", "inbound_nodes": [[["res2a_branch1", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2a_branch1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_17", "inbound_nodes": [[["bn2a_branch2c", 0, 0, {}], ["bn2a_branch1", 0, 0, {}]]], "config": {"name": "add_17", "trainable": false}}, {"class_name": "Activation", "name": "activation_53", "inbound_nodes": [[["add_17", 0, 0, {}]]], "config": {"name": "activation_53", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2b_branch2a", "inbound_nodes": [[["activation_53", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2b_branch2a", "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2b_branch2a", "inbound_nodes": [[["res2b_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2b_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_54", "inbound_nodes": [[["bn2b_branch2a", 0, 0, {}]]], "config": {"name": "activation_54", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2b_branch2b", "inbound_nodes": [[["activation_54", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2b_branch2b", "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2b_branch2b", "inbound_nodes": [[["res2b_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2b_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_55", "inbound_nodes": [[["bn2b_branch2b", 0, 0, {}]]], "config": {"name": "activation_55", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2b_branch2c", "inbound_nodes": [[["activation_55", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2b_branch2c", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2b_branch2c", "inbound_nodes": [[["res2b_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2b_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_18", "inbound_nodes": [[["bn2b_branch2c", 0, 0, {}], ["activation_53", 0, 0, {}]]], "config": {"name": "add_18", "trainable": false}}, {"class_name": "Activation", "name": "activation_56", "inbound_nodes": [[["add_18", 0, 0, {}]]], "config": {"name": "activation_56", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2c_branch2a", "inbound_nodes": [[["activation_56", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2c_branch2a", "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2c_branch2a", "inbound_nodes": [[["res2c_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2c_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_57", "inbound_nodes": [[["bn2c_branch2a", 0, 0, {}]]], "config": {"name": "activation_57", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2c_branch2b", "inbound_nodes": [[["activation_57", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2c_branch2b", "filters": 64, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2c_branch2b", "inbound_nodes": [[["res2c_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2c_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_58", "inbound_nodes": [[["bn2c_branch2b", 0, 0, {}]]], "config": {"name": "activation_58", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res2c_branch2c", "inbound_nodes": [[["activation_58", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res2c_branch2c", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn2c_branch2c", "inbound_nodes": [[["res2c_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn2c_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_19", "inbound_nodes": [[["bn2c_branch2c", 0, 0, {}], ["activation_56", 0, 0, {}]]], "config": {"name": "add_19", "trainable": false}}, {"class_name": "Activation", "name": "activation_59", "inbound_nodes": [[["add_19", 0, 0, {}]]], "config": {"name": "activation_59", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3a_branch2a", "inbound_nodes": [[["activation_59", 0, 0, {}]]], "config": {"strides": [2, 2], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3a_branch2a", "filters": 128, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3a_branch2a", "inbound_nodes": [[["res3a_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_60", "inbound_nodes": [[["bn3a_branch2a", 0, 0, {}]]], "config": {"name": "activation_60", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3a_branch2b", "inbound_nodes": [[["activation_60", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3a_branch2b", "filters": 128, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3a_branch2b", "inbound_nodes": [[["res3a_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_61", "inbound_nodes": [[["bn3a_branch2b", 0, 0, {}]]], "config": {"name": "activation_61", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3a_branch2c", "inbound_nodes": [[["activation_61", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3a_branch2c", "filters": 512, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Conv2D", "name": "res3a_branch1", "inbound_nodes": [[["activation_59", 0, 0, {}]]], "config": {"strides": [2, 2], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3a_branch1", "filters": 512, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3a_branch2c", "inbound_nodes": [[["res3a_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3a_branch1", "inbound_nodes": [[["res3a_branch1", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3a_branch1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_20", "inbound_nodes": [[["bn3a_branch2c", 0, 0, {}], ["bn3a_branch1", 0, 0, {}]]], "config": {"name": "add_20", "trainable": false}}, {"class_name": "Activation", "name": "activation_62", "inbound_nodes": [[["add_20", 0, 0, {}]]], "config": {"name": "activation_62", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3b_branch2a", "inbound_nodes": [[["activation_62", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3b_branch2a", "filters": 128, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3b_branch2a", "inbound_nodes": [[["res3b_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3b_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_63", "inbound_nodes": [[["bn3b_branch2a", 0, 0, {}]]], "config": {"name": "activation_63", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3b_branch2b", "inbound_nodes": [[["activation_63", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3b_branch2b", "filters": 128, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3b_branch2b", "inbound_nodes": [[["res3b_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3b_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_64", "inbound_nodes": [[["bn3b_branch2b", 0, 0, {}]]], "config": {"name": "activation_64", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3b_branch2c", "inbound_nodes": [[["activation_64", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3b_branch2c", "filters": 512, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3b_branch2c", "inbound_nodes": [[["res3b_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3b_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_21", "inbound_nodes": [[["bn3b_branch2c", 0, 0, {}], ["activation_62", 0, 0, {}]]], "config": {"name": "add_21", "trainable": false}}, {"class_name": "Activation", "name": "activation_65", "inbound_nodes": [[["add_21", 0, 0, {}]]], "config": {"name": "activation_65", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3c_branch2a", "inbound_nodes": [[["activation_65", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3c_branch2a", "filters": 128, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3c_branch2a", "inbound_nodes": [[["res3c_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3c_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_66", "inbound_nodes": [[["bn3c_branch2a", 0, 0, {}]]], "config": {"name": "activation_66", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3c_branch2b", "inbound_nodes": [[["activation_66", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3c_branch2b", "filters": 128, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3c_branch2b", "inbound_nodes": [[["res3c_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3c_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_67", "inbound_nodes": [[["bn3c_branch2b", 0, 0, {}]]], "config": {"name": "activation_67", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3c_branch2c", "inbound_nodes": [[["activation_67", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3c_branch2c", "filters": 512, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3c_branch2c", "inbound_nodes": [[["res3c_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3c_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_22", "inbound_nodes": [[["bn3c_branch2c", 0, 0, {}], ["activation_65", 0, 0, {}]]], "config": {"name": "add_22", "trainable": false}}, {"class_name": "Activation", "name": "activation_68", "inbound_nodes": [[["add_22", 0, 0, {}]]], "config": {"name": "activation_68", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3d_branch2a", "inbound_nodes": [[["activation_68", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3d_branch2a", "filters": 128, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3d_branch2a", "inbound_nodes": [[["res3d_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3d_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_69", "inbound_nodes": [[["bn3d_branch2a", 0, 0, {}]]], "config": {"name": "activation_69", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3d_branch2b", "inbound_nodes": [[["activation_69", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3d_branch2b", "filters": 128, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3d_branch2b", "inbound_nodes": [[["res3d_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3d_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_70", "inbound_nodes": [[["bn3d_branch2b", 0, 0, {}]]], "config": {"name": "activation_70", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res3d_branch2c", "inbound_nodes": [[["activation_70", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res3d_branch2c", "filters": 512, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn3d_branch2c", "inbound_nodes": [[["res3d_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn3d_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_23", "inbound_nodes": [[["bn3d_branch2c", 0, 0, {}], ["activation_68", 0, 0, {}]]], "config": {"name": "add_23", "trainable": false}}, {"class_name": "Activation", "name": "activation_71", "inbound_nodes": [[["add_23", 0, 0, {}]]], "config": {"name": "activation_71", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4a_branch2a", "inbound_nodes": [[["activation_71", 0, 0, {}]]], "config": {"strides": [2, 2], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4a_branch2a", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4a_branch2a", "inbound_nodes": [[["res4a_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_72", "inbound_nodes": [[["bn4a_branch2a", 0, 0, {}]]], "config": {"name": "activation_72", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4a_branch2b", "inbound_nodes": [[["activation_72", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4a_branch2b", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4a_branch2b", "inbound_nodes": [[["res4a_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_73", "inbound_nodes": [[["bn4a_branch2b", 0, 0, {}]]], "config": {"name": "activation_73", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4a_branch2c", "inbound_nodes": [[["activation_73", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4a_branch2c", "filters": 1024, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "Conv2D", "name": "res4a_branch1", "inbound_nodes": [[["activation_71", 0, 0, {}]]], "config": {"strides": [2, 2], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4a_branch1", "filters": 1024, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4a_branch2c", "inbound_nodes": [[["res4a_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4a_branch1", "inbound_nodes": [[["res4a_branch1", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4a_branch1", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_24", "inbound_nodes": [[["bn4a_branch2c", 0, 0, {}], ["bn4a_branch1", 0, 0, {}]]], "config": {"name": "add_24", "trainable": false}}, {"class_name": "Activation", "name": "activation_74", "inbound_nodes": [[["add_24", 0, 0, {}]]], "config": {"name": "activation_74", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4b_branch2a", "inbound_nodes": [[["activation_74", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4b_branch2a", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4b_branch2a", "inbound_nodes": [[["res4b_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4b_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_75", "inbound_nodes": [[["bn4b_branch2a", 0, 0, {}]]], "config": {"name": "activation_75", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4b_branch2b", "inbound_nodes": [[["activation_75", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4b_branch2b", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4b_branch2b", "inbound_nodes": [[["res4b_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4b_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_76", "inbound_nodes": [[["bn4b_branch2b", 0, 0, {}]]], "config": {"name": "activation_76", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4b_branch2c", "inbound_nodes": [[["activation_76", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4b_branch2c", "filters": 1024, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4b_branch2c", "inbound_nodes": [[["res4b_branch2c", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4b_branch2c", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Add", "name": "add_25", "inbound_nodes": [[["bn4b_branch2c", 0, 0, {}], ["activation_74", 0, 0, {}]]], "config": {"name": "add_25", "trainable": false}}, {"class_name": "Activation", "name": "activation_77", "inbound_nodes": [[["add_25", 0, 0, {}]]], "config": {"name": "activation_77", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4c_branch2a", "inbound_nodes": [[["activation_77", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4c_branch2a", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "valid", "kernel_size": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4c_branch2a", "inbound_nodes": [[["res4c_branch2a", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4c_branch2a", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_78", "inbound_nodes": [[["bn4c_branch2a", 0, 0, {}]]], "config": {"name": "activation_78", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4c_branch2b", "inbound_nodes": [[["activation_78", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "name": "res4c_branch2b", "filters": 256, "bias_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}}, "padding": "same", "kernel_size": [3, 3], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_regularizer": null}}, {"class_name": "BatchNormalization", "name": "bn4c_branch2b", "inbound_nodes": [[["res4c_branch2b", 0, 0, {}]]], "config": {"axis": 3, "momentum": 0.99, "scale": true, "gamma_constraint": null, "gamma_regularizer": null, "trainable": false, "epsilon": 0.001, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "name": "bn4c_branch2b", "beta_initializer": {"class_name": "Zeros", "config": {}}, "beta_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_79", "inbound_nodes": [[["bn4c_branch2b", 0, 0, {}]]], "config": {"name": "activation_79", "trainable": false, "activation": "relu"}}, {"class_name": "Conv2D", "name": "res4c_branch2c", "inbound_nodes": [[["activation_79", 0, 0, {}]]], "config": {"strides": [1, 1], "use_bias": true, "data_format": "channels_last", "trainable": false, "bias_initializer": {"class_name": "Zeros", "config": {}}, "activation": 